"use client";

import Link from 'next/link'
import { useTheme } from './context/ThemeContext';

export default function Home() {
  const { theme, toggleTheme } = useTheme();

  return (
    <main className={` ${
      theme === "dark" ? "dark-body" : "light-body"
    } `}>
      <section>
      <div className="p-4 text-center">
        <h1 className="text-3xl font-bold mb-4">
          مرحبًا بك في سكريبتو كود
        </h1>
        <p className="text-lg mb-4">
          سكريبتو كود هي شركة رائدة في مجال تطوير البرمجيات تأسست في عام 2020.
          نتخصص في تقديم مجموعة واسعة من حلول البرمجيات، بما في ذلك تطبيقات الويب،
          تطبيقات الديسكتوب، وتطبيقات الموبايل. التفاني في التقدم والجودة يميزنا في صناعة
          تكنولوجيا المعلومات.
        </p>
        <p className="text-lg mb-4">
          في سكريبتو كود، نؤمن بتقديم التميز. يعمل فريق المطورين الماهرين لدينا على
          إنشاء حلول برمجية مخصصة تلبي الاحتياجات الفريدة لعملائنا. سواء كنت تبحث عن
          تطبيق ويب قوي، أو أداة ديسكتوب، أو تجربة موبايل سلسة، فإننا نقدم لك كل ما تحتاجه.
        </p>
        <p className="text-lg mb-4">
          الابتكار والتكنولوجيا هما جوهر عملنا. نظل دائمًا في الصدارة، باعتماد أحدث
          التقنيات لتقديم حلول متقدمة تتجاوز توقعات عملائنا.
        </p>
        <p className="text-lg mb-4">
          رؤيتنا في سكريبتو كود هي أن نكون الرائدين في مجال تطوير البرمجيات، حيث
          نسعى باستمرار لتحقيق رضا العملاء وتلبية توقعاتهم من خلال الجودة والابتكار.
        </p>
        <p className="text-lg mb-4">
          الجودة ورضا العملاء هما قيم أساسية في سكريبتو كود. نهدف إلى أن نكون شريكًا
          موثوقًا للعملاء الذين يبحثون عن حلول برمجية مبتكرة وفعالة.
        </p>
      </div>
      <div className="p-4 text-center">
        <h1 className="text-3xl font-bold mb-4">
          مرحبًا بك في سكريبتو كود
        </h1>
        <p className="text-lg mb-4">
          سكريبتو كود هي شركة رائدة في مجال تطوير البرمجيات تأسست في عام 2020.
          نتخصص في تقديم مجموعة واسعة من حلول البرمجيات، بما في ذلك تطبيقات الويب،
          تطبيقات الديسكتوب، وتطبيقات الموبايل. التفاني في التقدم والجودة يميزنا في صناعة
          تكنولوجيا المعلومات.
        </p>
        <p className="text-lg mb-4">
          في سكريبتو كود، نؤمن بتقديم التميز. يعمل فريق المطورين الماهرين لدينا على
          إنشاء حلول برمجية مخصصة تلبي الاحتياجات الفريدة لعملائنا. سواء كنت تبحث عن
          تطبيق ويب قوي، أو أداة ديسكتوب، أو تجربة موبايل سلسة، فإننا نقدم لك كل ما تحتاجه.
        </p>
        <p className="text-lg mb-4">
          الابتكار والتكنولوجيا هما جوهر عملنا. نظل دائمًا في الصدارة، باعتماد أحدث
          التقنيات لتقديم حلول متقدمة تتجاوز توقعات عملائنا.
        </p>
        <p className="text-lg mb-4">
          رؤيتنا في سكريبتو كود هي أن نكون الرائدين في مجال تطوير البرمجيات، حيث
          نسعى باستمرار لتحقيق رضا العملاء وتلبية توقعاتهم من خلال الجودة والابتكار.
        </p>
        <p className="text-lg mb-4">
          الجودة ورضا العملاء هما قيم أساسية في سكريبتو كود. نهدف إلى أن نكون شريكًا
          موثوقًا للعملاء الذين يبحثون عن حلول برمجية مبتكرة وفعالة.
        </p>
      </div>
      <div className="p-4 text-center">
        <h1 className="text-3xl font-bold mb-4">
          مرحبًا بك في سكريبتو كود
        </h1>
        <p className="text-lg mb-4">
          سكريبتو كود هي شركة رائدة في مجال تطوير البرمجيات تأسست في عام 2020.
          نتخصص في تقديم مجموعة واسعة من حلول البرمجيات، بما في ذلك تطبيقات الويب،
          تطبيقات الديسكتوب، وتطبيقات الموبايل. التفاني في التقدم والجودة يميزنا في صناعة
          تكنولوجيا المعلومات.
        </p>
        <p className="text-lg mb-4">
          في سكريبتو كود، نؤمن بتقديم التميز. يعمل فريق المطورين الماهرين لدينا على
          إنشاء حلول برمجية مخصصة تلبي الاحتياجات الفريدة لعملائنا. سواء كنت تبحث عن
          تطبيق ويب قوي، أو أداة ديسكتوب، أو تجربة موبايل سلسة، فإننا نقدم لك كل ما تحتاجه.
        </p>
        <p className="text-lg mb-4">
          الابتكار والتكنولوجيا هما جوهر عملنا. نظل دائمًا في الصدارة، باعتماد أحدث
          التقنيات لتقديم حلول متقدمة تتجاوز توقعات عملائنا.
        </p>
        <p className="text-lg mb-4">
          رؤيتنا في سكريبتو كود هي أن نكون الرائدين في مجال تطوير البرمجيات، حيث
          نسعى باستمرار لتحقيق رضا العملاء وتلبية توقعاتهم من خلال الجودة والابتكار.
        </p>
        <p className="text-lg mb-4">
          الجودة ورضا العملاء هما قيم أساسية في سكريبتو كود. نهدف إلى أن نكون شريكًا
          موثوقًا للعملاء الذين يبحثون عن حلول برمجية مبتكرة وفعالة.
        </p>
      </div>
      </section>
    </main>
  )
}
